---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ComponentRepeater
source: html/65edb4cb-9043-8095-6562-b423669f4fb3.htm
---
# ComponentRepeater Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.